Revit 2027 API
FormattedText.SetSubscriptStatus(Boolean) Method
 Sets the characters in the entire text to be subscript or not subscript.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetSubscriptStatus(
	bool isSubscript
)
Public Sub SetSubscriptStatus (
	isSubscript As Boolean
)
public:
void SetSubscriptStatus(
	bool isSubscript
)
member SetSubscriptStatus :
        isSubscript : bool -> unit
Parameters
isSubscript Boolean
 The desired subscript status of characters in the entire text. True to set subscript, false to set not subscript.
Remarks
 If the characters are set to be subscript, they cannot be superscript. This sets the superscript status to false.
See Also
Reference
FormattedText Class
SetSubscriptStatus Overload
Autodesk.Revit.DB Namespace